---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPipeInvertElevation
source: html/e5501de2-789d-0f51-2b0f-1db8acfea827.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPipeInvertElevation Property

"Pipe Invert Elevation": This parameter is obsolete. It exists only for compatibility.

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPipeInvertElevation { get; }
```